MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32W062NTB/mcu.h
/*****************  Bit definition for RCC_APB2RSTR register  *****************/
#define  RCC_APB2RSTR_SYSCFGRST              ((uint32_t)0x00000001)            /*!< System Configurationregister reset */
#define  RCC_APB2RSTR_ADC1RST                ((uint32_t)0x00000200)            /*!< ADC 1 interface reset */
#define  RCC_APB2RSTR_TIM1RST                ((uint32_t)0x00000800)            /*!< TIM1 Timer reset */
#define  RCC_APB2RSTR_SPI1RST                ((uint32_t)0x00001000)            /*!< SPI 1 reset */
#define  RCC_APB2RSTR_UART1RST               ((uint32_t)0x00004000)            /*!< UART1 reset */
#define  RCC_APB2RSTR_CPTRST                 ((uint32_t)0x00008000)             /*!< CPT interface reset */
#define  RCC_APB2RSTR_TIM14RST               ((uint32_t)0x00010000)             /*!< TIM14 timer reset */
#define  RCC_APB2RSTR_TIM16RST               ((uint32_t)0x00020000)             /*!< TIM16 timer reset */
#define  RCC_APB2RSTR_TIM17RST               ((uint32_t)0x00040000)             /*!< TIM17 timer reset */
#define  RCC_APB2RSTR_DBGMCURST              ((uint32_t)0x00400000)             /*!< DBGMCU reset */

/*****************  Bit definition for RCC_APB1RSTR register  *****************/
#define  RCC_APB1RSTR_TIM2RST                ((uint32_t)0x00000001)        /*!< Timer 2 reset */
#define  RCC_APB1RSTR_TIM3RST                ((uint32_t)0x00000002)        /*!< Timer 3 reset */
#define  RCC_APB1RSTR_WWDGRST                ((uint32_t)0x00000800)        /*!< Window Watchdog reset */
#define  RCC_APB1RSTR_SPI2RST                ((uint32_t)0x00004000)        /*!< SPI 2 reset */
#define  RCC_APB1RSTR_UART2RST               ((uint32_t)0x00020000)        /*!< UART 2 reset */
#define  RCC_APB1RSTR_I2C1RST                ((uint32_t)0x00200000)        /*!< I2C 1 reset */
#define  RCC_APB1RSTR_USBRST                 ((uint32_t)0x00800000)        /*!< USB reset */
#define  RCC_APB1RSTR_CANRST                 ((uint32_t)0x02000000)        /*!< CAN reset */
#define  RCC_APB1RSTR_CRSRST                 ((uint32_t)0x08000000)        /*!< CRS interface reset */
#define  RCC_APB1RSTR_PWRRST                 ((uint32_t)0x10000000)        /*!< Power interface reset */

/******************  Bit definition for RCC_AHBENR register  ******************/
#define  RCC_AHBENR_DMA1EN                   ((uint32_t)0x00000001)            /*!< DMA1 clock enable */
#define  RCC_AHBENR_SRAMEN                   ((uint32_t)0x00000004)            /*!< SRAM interface clock enable */
#define  RCC_AHBENR_FLITFEN                  ((uint32_t)0x00000010)            /*!< FLITF clock enable */
#define  RCC_AHBENR_AESEN                    ((uint32_t)0x00000080)            /*!< AES clock enable */
#define  RCC_AHBENR_GPIOAEN                  ((uint32_t)0x00020000)            /*!< GPIOA clock enable */
#define  RCC_AHBENR_GPIOBEN                  ((uint32_t)0x00040000)            /*!< GPIOB clock enable */
#define  RCC_AHBENR_GPIOCEN                  ((uint32_t)0x00080000)            /*!< GPIOC clock enable */
#define  RCC_AHBENR_GPIODEN                  ((uint32_t)0x00100000)            /*!< GPIOD clock enable */

/******************  Bit definition for RCC_APB2ENR register  *****************/
#define  RCC_APB2ENR_SYSCFGEN                ((uint32_t)0x00000001)            /*!< System configuration register enable */
#define  RCC_APB2ENR_ADC1EN                  ((uint32_t)0x00000200)            /*!< ADC 1 interface clock enable */
#define  RCC_APB2ENR_TIM1EN                  ((uint32_t)0x00000800)            /*!< TIM1 Timer clock enable */
#define  RCC_APB2ENR_SPI1EN                  ((uint32_t)0x00001000)            /*!< SPI 1 clock enable */
#define  RCC_APB2ENR_UART1EN                 ((uint32_t)0x00004000)            /*!< UART1 clock enable */
#define  RCC_APB2ENR_CPTEN                   ((uint32_t)0x00008000)            /*!< Comparator interface clock enable */
#define  RCC_APB2ENR_TIM14EN                 ((uint32_t)0x00010000)            /*!< TIM14 Timer clock enable */
#define  RCC_APB2ENR_TIM16EN                 ((uint32_t)0x00020000)            /*!< TIM16 Timer clock enable */
#define  RCC_APB2ENR_TIM17EN                 ((uint32_t)0x00040000)            /*!< TIM17 Timer clock enable */
#define  RCC_APB2ENR_DBGMCUEN                ((uint32_t)0x00400000)            /*!< TIM17 Timer clock enable */

/*****************  Bit definition for RCC_APB1ENR register  ******************/
#define  RCC_APB1ENR_TIM2EN                  ((uint32_t)0x00000001)        /*!< Timer 2 clock enabled*/
#define  RCC_APB1ENR_TIM3EN                  ((uint32_t)0x00000002)        /*!< Timer 3 clock enable */
#define  RCC_APB1ENR_WWDGEN                  ((uint32_t)0x00000800)        /*!< Window Watchdog clock enable */
#define  RCC_APB1ENR_SPI2EN                  ((uint32_t)0x00004000)        /*!< SPI 2 clock enable */
#define  RCC_APB1ENR_UART2EN                 ((uint32_t)0x00020000)        /*!< UART 2 clock enable */
#define  RCC_APB1ENR_I2C1EN                  ((uint32_t)0x00200000)        /*!< I2C 1 clock enable */
#define  RCC_APB1ENR_USBEN                   ((uint32_t)0x00800000)        /*!< USB clock enable */
#define  RCC_APB1ENR_CANEN                   ((uint32_t)0x02000000)        /*!< CAN clock enable */
#define  RCC_APB1ENR_CRSEN                   ((uint32_t)0x08000000)        /*!< CRS interface enable */
#define  RCC_APB1ENR_PWREN                   ((uint32_t)0x10000000)        /*!< Power interface clock enable */

/*******************  Bit definition for RCC_CSR register  ********************/
#define  RCC_CSR_LSION                       ((uint32_t)0x00000001)        /*!< Internal Low Speed oscillator enable */
#define  RCC_CSR_LSIRDY                      ((uint32_t)0x00000002)        /*!< Internal Low Speed oscillator Ready */
#define  RCC_CSR_RMVF                        ((uint32_t)0x01000000)        /*!< Remove reset flag */
#define  RCC_CSR_PINRSTF                     ((uint32_t)0x04000000)        /*!< PIN reset flag */
#define  RCC_CSR_PORRSTF                     ((uint32_t)0x08000000)        /*!< POR/PDR reset flag */
#define  RCC_CSR_SFTRSTF                     ((uint32_t)0x10000000)        /*!< Software Reset flag */
#define  RCC_CSR_IWDGRSTF                    ((uint32_t)0x20000000)        /*!< Independent Watchdog reset flag */
#define  RCC_CSR_WWDGRSTF                    ((uint32_t)0x40000000)        /*!< Window watchdog reset flag */
#define  RCC_CSR_LPWRRSTF                    ((uint32_t)0x80000000)        /*!< Low-Power reset flag */

/******************************************************************************/
/*                                                                            */
/*                           Clock feedback system                            */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CRS_CR register  *******************/
#define  CRS_CR_SYNCOKIE                      ((uint16_t)0x0001)        /*!< SYNC event OK interrupt enable */
#define  CRS_CR_SYNCWARNIE                    ((uint16_t)0x0002)        /*!< SYNC warning interrupt enable */
#define  CRS_CR_ERRIE                         ((uint16_t)0x0004)        /*!< Synchronization or trimming error interrupt enable */
#define  CRS_CR_ESYNCIE                       ((uint16_t)0x0008)        /*!< Expected SYNC interrupt enable */
#define  CRS_CR_CEN                           ((uint16_t)0x0020)        /*!< Frequency error counter enable */
#define  CRS_CR_AUTOTRIMEN                    ((uint16_t)0x0040)        /*!< Automatic trimming enable */
#define  CRS_CR_SWSYNC                        ((uint16_t)0x0080)        /*!< Generate software SYNC event */
#define  CRS_CR_TRIM                          ((uint16_t)0x3F00)        /*!< HSI48 oscillator smooth trimming */

/*******************  Bit definition for CRS_CFGR register  *******************/
#define  CRS_CFGR_RELOAD                      ((uint32_t)0x0000FFFF)    /*!< Counter reload value */
#define  CRS_CFGR_FELIM                       ((uint32_t)0x00FF0000)    /*!< Frequency error limit */

