MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32W062NTB/mcu.h
/********************  Bit definition for ADDATA register  ********************/
#define  ADDATA_DATA                        ((uint32_t)0x0000FFFF)               /*!<ADC 12bit convert data */

#define  ADDATA_CHANNELSEL                  ((uint32_t)0x000F0000)               /*!<CHANNELSEL[19:16] (ADC current channel convert data) */
#define  ADDATA_CHANNELSEL_CH0              ((uint32_t)0x00000000)               /*!<CHANNELSEL CH0*/
#define  ADDATA_CHANNELSEL_CH1              ((uint32_t)0x00010000)               /*!<CHANNELSEL CH1*/
#define  ADDATA_CHANNELSEL_CH2              ((uint32_t)0x00020000)               /*!<CHANNELSEL CH2*/
#define  ADDATA_CHANNELSEL_CH3              ((uint32_t)0x00030000)               /*!<CHANNELSEL CH3*/
#define  ADDATA_CHANNELSEL_CH4              ((uint32_t)0x00040000)               /*!<CHANNELSEL CH4*/
#define  ADDATA_CHANNELSEL_CH5              ((uint32_t)0x00050000)               /*!<CHANNELSEL CH5*/
#define  ADDATA_CHANNELSEL_CH6              ((uint32_t)0x00060000)               /*!<CHANNELSEL CH6*/
#define  ADDATA_CHANNELSEL_CH7              ((uint32_t)0x00070000)               /*!<CHANNELSEL CH7*/
#define  ADDATA_CHANNELSEL_CH8              ((uint32_t)0x00080000)               /*!<CHANNELSEL CH8*/
#define  ADDATA_CHANNELSEL_CH9              ((uint32_t)0x00090000)               /*!<CHANNELSEL CH9*/
#define  ADDATA_CHANNELSEL_TempSenSor       ((uint32_t)0x000A0000)               /*!<CHANNELSEL CH10*/
#define  ADDATA_CHANNELSEL_VolSensor        ((uint32_t)0x000B0000)               /*!<CHANNELSEL CH11*/
#define  ADDATA_CHANNELSEL_CH12             ((uint32_t)0x000C0000)               /*!<CHANNELSEL CH12*/
#define  ADDATA_CHANNELSEL_CH13             ((uint32_t)0x000D0000)               /*!<CHANNELSEL CH13*/
#define  ADDATA_CHANNELSEL_CH14             ((uint32_t)0x000E0000)               /*!<CHANNELSEL CH14*/
#define  ADDATA_CHANNELSEL_CH15             ((uint32_t)0x000F0000)               /*!<CHANNELSEL CH15*/

#define  ADDATA_OVERRUN                     ((uint32_t)0x00100000)               /*!<ADC data will be cover */
#define  ADDATA_VALID                       ((uint32_t)0x00200000)               /*!<ADC data[11:0] is valid*/

/********************  Bit definition for ADCFG register  ********************/
#define  ADCFG_ADEN                        ((uint32_t)0x00000001)               /*!<ADC convert enable */
#define  ADCFG_ADWEN                       ((uint32_t)0x00000002)               /*!<ADC window compare enable */
#define  ADCFG_TSEN                        ((uint32_t)0x00000004)               /*!<ADC sensor enable */
#define  ADCFG_VSEN                        ((uint32_t)0x00000008)               /*!<ADC sensor enable */

#define  ADCFG_ADCPRE                      ((uint32_t)0x00000070)               /*!<ADC preclk  */
#define  ADCFG_ADCPRE_2                    ((uint32_t)0x00000000)               /*!<ADC preclk 2 */
#define  ADCFG_ADCPRE_4                    ((uint32_t)0x00000010)               /*!<ADC preclk 4 */
#define  ADCFG_ADCPRE_6                    ((uint32_t)0x00000020)               /*!<ADC preclk 6 */
#define  ADCFG_ADCPRE_8                    ((uint32_t)0x00000030)               /*!<ADC preclk 8 */
#define  ADCFG_ADCPRE_10                   ((uint32_t)0x00000040)               /*!<ADC preclk 10 */
#define  ADCFG_ADCPRE_12                   ((uint32_t)0x00000050)               /*!<ADC preclk 12 */
#define  ADCFG_ADCPRE_14                   ((uint32_t)0x00000060)               /*!<ADC preclk 14 */
#define  ADCFG_ADCPRE_16                   ((uint32_t)0x00000070)               /*!<ADC preclk 16 */

#define  ADCFG_RSLTCTL                     ((uint32_t)0x00000380)               /*!<ADC resolution select*/
#define  ADCFG_RSLTCTL_12                  ((uint32_t)0x00000000)               /*!<ADC resolution select 12bit*/
#define  ADCFG_RSLTCTL_11                  ((uint32_t)0x00000080)               /*!<ADC resolution select 11bit*/
#define  ADCFG_RSLTCTL_10                  ((uint32_t)0x00000100)               /*!<ADC resolution select 10bit*/
#define  ADCFG_RSLTCTL_9                   ((uint32_t)0x00000180)               /*!<ADC resolution select 9bit*/
#define  ADCFG_RSLTCTL_8                   ((uint32_t)0x00000200)               /*!<ADC resolution select 8bit*/

#define  ADCFG_SAMCTL                      ((uint32_t)0x00001C00)               /*!<ADC sample time select*/
#define  ADCFG_SAMCTL_1_5                  ((uint32_t)0x00000000)               /*!<ADC sample time select 1.5t*/
#define  ADCFG_SAMCTL_7_5                  ((uint32_t)0x00000400)               /*!<ADC sample time select 7.5t*/
#define  ADCFG_SAMCTL_13_5                 ((uint32_t)0x00000800)               /*!<ADC sample time select 13.5t*/
#define  ADCFG_SAMCTL_28_5                 ((uint32_t)0x00000C00)               /*!<ADC sample time select 28.5t*/
#define  ADCFG_SAMCTL_41_5                 ((uint32_t)0x00001000)               /*!<ADC sample time select 41.5t*/
#define  ADCFG_SAMCTL_55_5                 ((uint32_t)0x00001400)               /*!<ADC sample time select 55.5t*/
#define  ADCFG_SAMCTL_71_5                 ((uint32_t)0x00001800)               /*!<ADC sample time select 71.5t*/
#define  ADCFG_SAMCTL_239_5                ((uint32_t)0x00001C00)               /*!<ADC sample time select 239.5t*/

/********************  Bit definition for ADCR register  ********************/
#define  ADCR_ADIE                         ((uint32_t)0x00000001)               /*!<ADC interrupt enable */
#define  ADCR_ADWIE                        ((uint32_t)0x00000002)               /*!<ADC window compare interrupt enable */
#define  ADCR_TRGEN                        ((uint32_t)0x00000004)               /*!<extranal trigger single start AD convert */
#define  ADCR_DMAEN                        ((uint32_t)0x00000008)               /*!<ADC DMA enable */
#define  ADCR_TRGSEL                       ((uint32_t)0x00000070)               /*!<TRGSEL[6:4] ADC1 external trigger source select */
#define  ADCR_TRGSEL_0                     ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADCR_TRGSEL_1                     ((uint32_t)0x00000020)               /*!<Bit 1 */
#define  ADCR_TRGSEL_2                     ((uint32_t)0x00000040)               /*!<Bit 2 */

